/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : fsmc_sram.h
* Author             : MCD Application Team
* Version            : V2.0.2
* Date               : 07/11/2008
* Description        : Header for fsmc_sram.c file.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/
#ifdef TABLE_C
	#define _USR_EXTTABLE
#else
	#define _USR_EXTTABLE	extern
#endif

#define TableMAX62				62
#if 0
typedef union{
	INT8U uD8[2];
	
    INT16U uD16;
	INT16S sD16;

} type16;
#endif
enum
{
 	TRIO_M_TBL= 0x01,
	TRIO_MM_TBL,
	Default_TBL = 0x7F,

};



#pragma pack(2)



////////////////////////////////////////////////////////////////////////////////
// Internal FLASH CASE
////////////////////////////////////////////////////////////////////////////////
// BACKUP 1st ADDRESS AREA(DON'T OVER 1024 Bytes
typedef struct {
	union{
		INT8U	Data[500];

		struct {
			INT8U	IsDataFlag;
			INT8U	IsFirstFlag;
			INT8U	TransceiveMaker;
//////////////////////////////////////////////////////////////////////////20131004
			INT8S FwdOutUpperLmt_3G[2]; 		// 0x0504
			INT8S FwdOutLowerLmt_3G[2]; 		// 0x0505
			INT8U FwdGainSet_3G;				// 0x0529  Forward Gain(설정값)
			INT8S FwdOutUpperLmt_2G[2]; 		// 0x0515
			INT8S FwdOutLowerLmt_2G[2]; 		// 0x0516
			INT8U FwdGainSet_2G;				// 0x0542  Forward Gain(설정값)
		
			INT8S FwdOutUpperLmt_LTE[2];		// 0x0557	
			INT8S FwdOutLowerLmt_LTE[2];		// 0x0558
			INT8U FwdGainSet_LTE;				// 0x056E  Forward Gain(설정값)
		
			INT8S FwdOutPwr_LTE_A2[2];			// 0x1B14
			INT8S FwdOutUpperLmt_LTE_A2[2]; 	// 0x1B15  (Range: 7 ~ 17dBm)
			INT8S FwdOutLowerLmt_LTE_A2[2]; 	// 0x1B16
		
			INT8U FwdGainSet_LTE_A2;			// 0x1B1A  Forward Gain(설정값) 38~83dB
		
			INT8U Rvs0GainSet_3G;				// 0x0604	Reverse Gain(설정값)
			INT8U RvsGainBalance_3G;			// 0x062D	Reverse Gain Balance
		
			INT8U Rvs0GainSet_2G;				// 0x060F	Reverse Gain(설정값)
			INT8U RvsGainBalance_2G;			// 0x063F	Reverse Gain Balance
		
			INT8U Rvs0GainSet_LTE;				// 0x0669	Reverse Gain(설정값)
			INT8U RvsGainBalance_LTE;			// 0x0676	Reverse Gain Balance
		
			INT8U Rvs0GainSet_LTE_A2;			// 0x1C0B	Reverse Gain(설정값)
			INT8U RvsGainBalance_LTE_A2;		// 0x1C0C	Reverse Gain Balance
		
			INT8U LTE15MUse;					// 0x1059
			INT8U Band_Select_LTE_A2[3];		// 0x1066
			INT8U FemtocellUseOnOff;			// 0x1062
			INT8U RepeatResetPriod; 			// 0x102A
			INT8U HostNumber[11];				// 0x0920
			INT8U AutoReportPriod;				// 0x0922
			INT8U AutoReportBasePer[2]; 		// 0x0923
		
			INT8U AGCOnOff_3G;					// 0x090A
			INT8U AGCOnOff_CDMALTE; 			// 0x1068
			INT8U AGCOnOff_LTE_A_0; 			// 0x1069
			INT8U AGCMode_3G;					// 0x105B
			INT8U AGCMode_2G;					// 0x105C
			INT8U AGCMode_LTE;					// 0x105D
			INT8U AGCMode_LTE_A2;				// 0x1067
			INT8U TPTL_OnOff;					// 0xA000					
			INT8S TempOffset;					// 0xA001
			INT8U AlarmMask;					// 0xA00D
			INT8U VccDet_Lmt[2]; 				// 0xA02B
			INT8S FwdInPwrOffset_2G;			// 0xA101
			INT8S FwdInPwrOffset_3G;			// 0xA102
			INT8S Rvs0OutPwrOffset_2G;			// 0xA109
			INT8S Rvs0OutPwrOffset_3G;			// 0xA10B
			INT8S FwdOutPwrOffset_2G;			// 0xA158
			INT8S FwdOutPwrOffset_3G;			// 0xA159
		
			INT8S FwdInPwrOffset_LTE;			// 0xA1C3
			INT8S FwdOutPwrOffset_LTE;			// 0xA1C4
			INT8S RvsOutPwrOffset_LTE;			// 0xA1CD
		
			INT8U FwdGainOffset_3G; 			// 0xA36A
			INT8U RvsGainOffset_3G; 			// 0xA36B
			INT8U FwdGainOffset_2G; 			// 0xA36C
			INT8U RvsGainOffset_2G; 			// 0xA36D
		
			__DETOffset DetOffset;				// 0xA802
			INT8U FwdGainOffset_LTE;			// 0xA822
			INT8U RvsGainOffset_LTE;			// 0xA823
			INT8S FwdInPwrOffset_LTE_A2;		// 0xA870
			INT8S FwdOutPwrOffset_LTE_A2;		// 0xA871
			INT8S RvsOutPwrOffset_LTE_A2;		// 0xA872
			INT8U FwdGainOffset_LTE_A2; 		// 0xA87C
			INT8U RvsGainOffset_LTE_A2; 		// 0xA87D
			//////////////////////////////////////////////////////////////////////////////Wave
		
			INT8U RxMaxVal[2];					// 0x0C03
			INT8U RxMinVal[2];					// 0x0C04
			INT8U TxMaxVal[2];					// 0x0C05
			INT8U TxMinVal[2];					// 0x0C06
			INT8U EcIo; 						// 0x0C09
			INT8U AR_Mode[2];					// 0x0C11
			INT8U Radio_ReportTime[2];			// 0x0C12
			INT8U Radio_ReportPeriod[2];		// 0x0C13
			INT8U TestStn[11];					// 0x0C14
		////////////////
			INT8U FwdAmpOnOff_3G;				// 0x0706
			INT8U FwdAmpOnOff_2G;				// 0x0715
			INT8U FwdAmpOnOff_LTE;				// 0x074F
			INT8U FwdAmpOnOff_LTE_A2;			// 0x0759
		///////////////////////////////////////////////////////////////
		
			INT8S RvsALCLvl_2G; 				// 0xA85D
			INT8S RvsALCLvl_LTE;				// 0xA85E
			INT8S RvsALCLvl_LTE_A2; 			// 0xA893
			INT8S RvsALCLvl_3G; 				// 0xA860
		///////////////////////////////////////////////////////////
			INT8U MasterPNH;					//
			INT8U MasterPNL;
			INT8U RB_StsOnOff;					// 0xD019
			INT8U DCOffSet[2];					// 0xD01C
			INT8U PllFregOffset_LTE;			// 0xA8AD	
		
			__SleepMode  SleepMode_2G;
			__SleepMode  SleepMode_LTE;
			__SleepMode  SleepMode_LTE_A1;
			__SleepMode  SleepMode_LTE_A2;


			///////////////////////////////////
			INT8U BalanceModeOnOff; 		// 0x082A
			INT8S BalanceModeDetOffset[4];					// 0xAD09
			
			INT8U AvgMAXGARBAGE_Tx[4];
			INT8U AvgMINGARBAGE_Tx[4];
			INT8U PeakMAXGARBAGE_Tx[4];
			INT8U PeakMINGARBAGE_Tx[4];
			
			INT8U PeakMAXGARBAGE_Rx[4];
			INT8U PeakMINGARBAGE_Rx[4];
			
//			__BalanceModeDET		BalanceModeDetOffset;	// 0xAD09
		};
	} BackUp;
} EE_BACK1;

#if 1

#define AttTBL_Size 				61
#define TempTBL_Size				22

#define AttMaxLimit 				60
#define TempMaxlimit				80

#define OutputTBL_Size				60


enum {
	Index_FwdOutAvgPwr_2G	= 0x00,
	Index_FwdOutPeakPwr_2G, 
	Index_RvsOutPwr_2G, 

	Index_FwdOutAvgPwr_LTE, 
	Index_FwdOutPeakPwr_LTE, 
	Index_RvsInPwr_LTE, 
	Index_RvsOutPwr_LTE, 

	Index_FwdInPwr_CDMALTE,
	Index_FwdOutAvgPwr_CDMALTE, 
	Index_FwdOutPeakPwr_CDMALTE, 
	Index_RvsInPwr_CDMALTE, 		 ///10
	Index_RvsOutPwr_CDMALTE, 
	
	Index_FwdOutAvgPwr_LTE_A1, 
	Index_FwdOutPeakPwr_LTE_A1, 
	Index_RvsOutPwr_LTE_A1, 

	Index_FwdOutAvgPwr_LTE_A2, 
